W6D3/NewRouteController/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "rupesh"], ["email", "ssshhsfds.io"], ["created_at", "2021-01-03 00:41:38.730047"], ["updated_at", "2021-01-03 00:41:38.730047"]]
---
    def create
        user = User.new(user_columns)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "claudia1"], ["updated_at", "2021-01-03 00:43:05.305652"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_columns)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user_new =  User.delete(params[:id])